# 서울시 인구 분석

<img src='https://raw.githubusercontent.com/Jangrae/img/master/people2.png' width="650" align="left">

## 1. 라이브러리 불러오기

- 사용할 라이브러리를 불러옵니다.

In [1]:
# 기본 라이브러리 가져오기
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

* 데이터 불러오기

    - 다음 경로의 파일을 읽어와 pop01, pop02, pop03 데이터프레임을 만듭니다.
    - 파일 경로1: https://raw.githubusercontent.com/Jangrae/csv/master/seoul_pop_h01.csv
    - 파일 경로2: https://raw.githubusercontent.com/Jangrae/csv/master/seoul_pop_h02.csv
    - 파일 경로3: https://raw.githubusercontent.com/Jangrae/csv/master/seoul_pop_h03.csv

In [21]:
pop01 = pd.read_csv('https://raw.githubusercontent.com/Jangrae/csv/master/seoul_pop_h01.csv')
pop01.head()

   year  k_male  k_female
0  1981    4160      4191
1  1982    4160      4191
2  1983    4160      4191
3  1984    4160      4191
4  1985    4160      4191

In [22]:
pop02 = pd.read_csv('https://raw.githubusercontent.com/Jangrae/csv/master/seoul_pop_h02.csv')
pop02.head()

   year  f_male  f_female
0  1985       7         6
1  1986       7         5
2  1987       6         5
3  1988       5         5
4  1989       6         5

In [23]:
pop03 = pd.read_csv('https://raw.githubusercontent.com/Jangrae/csv/master/seoul_pop_h03.csv')
pop03.head()

   year  household  older_65
0  1981       1915       246
1  1982       2001       260
2  1983       2116       260
3  1984       2246       275
4  1985       2338       211

## 2. 데이터 탐색

다음과 같은 정보 확인을 통해 처리할 대상 데이터를 이해합니다.
- 상/하위 데이터 확인
- 데이터프레임 크기 확인
- 열 이름, 데이터 형식, 값 개수 등 확인
- 기초 통계정보 확인
- 결측치 확인
- 범주형 데이터 확인
- 개별 열 값 상세 확인 등

**1) 데이터프레임 크기 확인**

- 세 개의 데이터프레임 크기(행 수, 열 수)를 확인합니다.

In [6]:
display(pop01.shape)
display(pop02.shape)
display(pop03.shape)

(40, 3)

(36, 3)

(40, 3)

**2) year 최솟값, 최댓값 확인**

- 세 개의 데이터프레임 year열 최솟값, 최댓값 크기를 비교해 차이가 있는 지 각각 확인합니다.

In [8]:
display(pop01['year'].agg(['min','max']))
display(pop02['year'].agg(['min','max']))
display(pop03['year'].agg(['min','max']))

min    1981
max    2020
Name: year, dtype: int64

min    1985
max    2020
Name: year, dtype: int64

min    1981
max    2020
Name: year, dtype: int64

**3) 결측치 확인**

- 세 개의 데이터프레임에 결측치가 있는 지 각각 확인합니다.

In [24]:
display(pop01.isnull().sum())
display(pop02.isnull().sum())
display(pop03.isnull().sum())

year        0
k_male      0
k_female    0
dtype: int64

year        0
f_male      0
f_female    0
dtype: int64

year         0
household    0
older_65     0
dtype: int64

**4) 열 정보 확인**

- 세 개의 데이터프레임의 열 정보를 확인합니다.

In [12]:
display(pop01.columns)
display(pop02.columns)
display(pop03.columns)

Index(['year', 'k_male', 'k_female'], dtype='object')

Index(['year', 'f_male', 'f_female'], dtype='object')

Index(['year', 'household', 'older_65'], dtype='object')

## 3. 데이터 전처리

전처리 과정에서 다음과 같은 처리를 할 수 있습니다.

- 결측치 처리
- 값 변경
- 열 추가
- 불필요한 열 제거
- 열 이름 변경
- 데이터 통합(연결 또는 조인)
- 가변수화 등

**1) 데이터 통합**

- concat을 사용해 연결하면 인덱스 값을 기준으로 연결되어 데이터가 어긋납니다.
- **year** 열을 기준으로 **outer** 방식으로 조인(병합)합니다.
- 외국인 정보가 1981 ~ 1984년이 누락되어 결측치가 발생할 것입니다.
- 세 개의 데이터프레임을 병합(조인)하여 pop 데이터프레임을 선언합니다.
- 이후의 모든 작업은 pop 데이터프레임을 대상으로 진행합니다.

In [27]:
pop = pd.merge(pop01,pop02, how='outer', on='year')
pop = pd.merge(pop, pop03, how='outer', on='year')
pop.head()

   year  k_male  k_female  f_male  f_female  household  older_65
0  1981    4160      4191     NaN       NaN       1915       246
1  1982    4160      4191     NaN       NaN       2001       260
2  1983    4160      4191     NaN       NaN       2116       260
3  1984    4160      4191     NaN       NaN       2246       275
4  1985    4160      4191     7.0       6.0       2338       211

**2) 결측치 확인**

- 결측치가 있는지 확인합니다.

In [28]:
pop.isna().sum()

year         0
k_male       0
k_female     0
f_male       4
f_female     4
household    0
older_65     0
dtype: int64

**3) 결측치 처리**

- 연도별 인구 현황이므로 임의의 값을 채우는 것이 바람직하지 않아 보입니다.
- 이후 값, 즉 1985년 값으로 채우는 것도 정확한 분석을 방해할 것 같습니다.
- 이에 결측치가 있는 1981년~1984년 행을 제거할 것입니다.

In [43]:
pop.dropna(axis=0,inplace=True)
pop.isnull().sum()

year         0
k_male       0
k_female     0
f_male       0
f_female     0
household    0
older_65     0
dtype: int64

**3) 열 추가**

- 이후 분석의 편의를 위해 다음과 같은 의미를 갖는 열을 추가하고자 합니다.
    - k_total = 전체 한국인 인구수
    - f_total = 전체 외국인 인구수
    - male = 전체 남자 인구수
    - female = 전체 여자 인구수
    - total = 전체 인구수
- 추가할 열에 대한 공식은 다음과 같습니다.
    - k_total = k_male + k_female
    - f_total = f_male + f_female
    - male = k_male + f_male
    - female = k_female + f_female
    - total = k_total + f_total
- 정리한 공식에 따라 데이터프레임에 열을 추가합니다.

In [44]:
pop['k_total']=pop['k_male']+pop['k_female']
pop['f_total'] = pop['f_male'] + pop['f_female']
pop['male'] = pop['k_male'] + pop['f_male']
pop['female'] = pop['k_female'] + pop['f_female']
pop['total'] = pop['k_total'] + pop['f_total']
pop.head()

,year,k_male,k_female,f_male,f_female,household,older_65,k_total,f_total,male,female,total
4,1985,4160,4191,7.0,6.0,2338,211,8351,13.0,4167.0,4197.0,8364.0
5,1986,4899,4888,7.0,5.0,2428,305,9787,12.0,4906.0,4893.0,9799.0
6,1987,5000,4979,6.0,5.0,2518,329,9979,11.0,5006.0,4984.0,9990.0
7,1988,5156,5120,5.0,5.0,2658,349,10276,10.0,5161.0,5125.0,10286.0
8,1989,5305,5261,6.0,5.0,2817,363,10566,11.0,5311.0,5266.0,10577.0

**4) 열 순서 변경**

- 데이터 이해를 돕기 위해 다음과 같은 순서로 데이터프레임 열 순서를 변경합니다.
- year, household, total, male, female, k_total, k_male, k_female, f_total, f_male, f_female, older_65

In [47]:
pop = pop[['year', 'household', 'total', 'male', 'female', 'k_total', 'k_male', 'k_female', 'f_total', 'f_male', 'f_female', 'older_65']]

In [48]:
pop.head()

,year,household,total,male,female,k_total,k_male,k_female,f_total,f_male,f_female,older_65
4,1985,2338,8364.0,4167.0,4197.0,8351,4160,4191,13.0,7.0,6.0,211
5,1986,2428,9799.0,4906.0,4893.0,9787,4899,4888,12.0,7.0,5.0,305
6,1987,2518,9990.0,5006.0,4984.0,9979,5000,4979,11.0,6.0,5.0,329
7,1988,2658,10286.0,5161.0,5125.0,10276,5156,5120,10.0,5.0,5.0,349
8,1989,2817,10577.0,5311.0,5266.0,10566,5305,5261,11.0,6.0,5.0,363

**5) 인덱스 초기화**

- 인덱스가 0부터 시작하는 일련 변호를 갖지 않는다면 인덱스를 초기화합니다.

In [52]:
pop.reset_index(drop=True, inplace=True)

In [55]:
pop.head()
pop.shape

(36, 12)

## 4. 추가 전처리

* x, y 구분

    - x : feature
    - y : target <- total

In [59]:
x=pop.drop('total',axis=1)
x.head(1)

,year,household,male,female,k_total,k_male,k_female,f_total,f_male,f_female,older_65
0,1985,2338,4167.0,4197.0,8351,4160,4191,13.0,7.0,6.0,211

In [60]:
y=pop['total']
y.head(1)

0    8364.0
Name: total, dtype: float64

In [61]:
x.shape,y.shape

((36, 11), (36,))

* train test split

In [64]:
from sklearn.model_selection import train_test_split

In [65]:
x_train, x_test, y_train, y_test =\
train_test_split(x,y, test_size=0.2,random_state=2022 )

In [67]:
x_train.shape,y_train.shape

((28, 11), (28,))

* Scaling

In [68]:
x_train.describe()

,year,household,male,female,k_total,k_male,k_female,f_total,f_male,f_female,older_65
count,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000
mean,2003.178571,3689.928571,5126.285714,5182.428571,10165.214286,5056.857143,5108.357143,143.500000,69.428571,74.071429,786.321429
std,10.677264,590.524433,260.974223,230.244223,491.413483,273.743962,225.155126,108.886791,51.465507,57.437843,396.927744
min,1985.000000,2338.000000,4167.000000,4197.000000,8351.000000,4160.000000,4191.000000,9.000000,5.000000,4.000000,211.000000
25%,1993.750000,3449.750000,5007.500000,5142.000000,9967.000000,4974.750000,5047.250000,39.000000,20.500000,18.500000,451.750000
50%,2003.500000,3747.500000,5165.000000,5204.000000,10198.000000,5068.500000,5126.500000,109.000000,51.500000,57.500000,671.500000
75%,2011.250000,4184.000000,5215.750000,5283.750000,10312.000000,5148.250000,5178.750000,255.250000,122.250000,132.500000,1064.500000
max,2020.000000,4418.000000,5519.000000,5451.000000,10935.000000,5500.000000,5435.000000,284.000000,137.000000,148.000000,1568.000000

In [70]:
from sklearn.preprocessing import MinMaxScaler

In [72]:
mm_scaler = MinMaxScaler()

In [73]:
x_train = mm_scaler.fit_transform(x_train)
x_test = mm_scaler.transform(x_test)

In [74]:
pd.DataFrame(x_train).describe()

,0,1,2,3,4,5,6,7,8,9,10
count,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000,28.000000
mean,0.519388,0.649966,0.709531,0.785828,0.702095,0.669296,0.737425,0.489091,0.488095,0.486607,0.423966
std,0.305065,0.283906,0.193028,0.183608,0.190175,0.204287,0.180993,0.395952,0.389890,0.398874,0.292504
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.250000,0.534495,0.621672,0.753589,0.625387,0.608022,0.688304,0.109091,0.117424,0.100694,0.177413
50%,0.528571,0.677644,0.738166,0.803030,0.714783,0.677985,0.752010,0.363636,0.352273,0.371528,0.339352
75%,0.750000,0.887500,0.775703,0.866627,0.758901,0.737500,0.794011,0.895455,0.888258,0.892361,0.628961
max,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

## 5. 모델링

* 모델 선언

* 모델 학습

* 학습한 모델 기반으로 예측값 생성

## 6. 평가